fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВКМ_ОбслуживаниеКлиентов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</xr:Item>
				<xr:Item>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специалист</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроведенияРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаРаботПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияРаботПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПроблемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыполненныеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОписаниеРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическиПотраченоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧасыКОплатеКлиенту</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ВКМ_ВыполненныеКлиентуРаботы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКОплате</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВКМ_Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВКМ_УсловияОплатыСотрудников</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентОтРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ВКМ_ВыполненныеСотрудникомРаботы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЧасовКОплате</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКОплате</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВКМ_АбонентскоеОбслуживание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ДоговорыКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКМ_ДатаНачалаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКМ_ДатаОкончанияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКМ_СуммаАбонентскойПлаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВКМ_Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКМ_СтоимостьЧасаРаботы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВКМ_Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиентов/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// =====================================================================
	// 1. ПОЛУЧЕНИЕ ДАННЫХ ПО ДОГОВОРУ
	// =====================================================================
	
	Если Не ЗначениеЗаполнено(Договор) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен договор!";
		Сообщение.Поле = "Договор";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры.ВидДоговора КАК ВидДоговора,
		|	Договоры.ВКМ_ДатаНачалаДоговора КАК ДатаНачала,
		|	Договоры.ВКМ_ДатаОкончанияДоговора КАК ДатаОкончания,
		|	ISNULL(Договоры.ВКМ_СтоимостьЧасаРаботы, 0) КАК СтоимостьЧаса
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК Договоры
		|ГДЕ
		|	Договоры.Ссылка = &Договор";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	
	ВыборкаДоговора = Запрос.Выполнить().Выбрать();
	
	СтоимостьЧасаПоДоговору = 0; // Переменная для хранения ставки
	
	Если ВыборкаДоговора.Следующий() Тогда
		
		// Сохраняем стоимость часа для будущих расчетов
		СтоимостьЧасаПоДоговору = ВыборкаДоговора.СтоимостьЧаса;
		
		// А. Проверка типа договора
		Если ВыборкаДоговора.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Допустим только договор 'Абонентское обслуживание'!";
			Сообщение.Поле = "Договор";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		Иначе
			// Б. Проверка сроков
			ДатаДокумента = НачалоДня(Дата);
			ДатаНачала = ?(ЗначениеЗаполнено(ВыборкаДоговора.ДатаНачала), НачалоДня(ВыборкаДоговора.ДатаНачала), Дата('00010101'));
			ДатаОкончания = ?(ЗначениеЗаполнено(ВыборкаДоговора.ДатаОкончания), НачалоДня(ВыборкаДоговора.ДатаОкончания), Дата('39991231'));
			
			Если ДатаДокумента < ДатаНачала ИЛИ ДатаДокумента > ДатаОкончания Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Дата документа не попадает в период действия договора!";
				Сообщение.Поле = "Дата";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// =====================================================================
	// 2. ДВИЖЕНИЯ ПО РЕГИСТРУ "ВКМ_ВыполненныеКлиентуРаботы"
	// =====================================================================
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	ВсегоЧасовКОплате = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
	
	Если ВсегоЧасовКОплате > 0 Тогда
		Запись = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Запись.Период = Дата;
		Запись.Клиент = Клиент;
		Запись.Договор = Договор;
		Запись.КоличествоЧасов = ВсегоЧасовКОплате;
		Запись.СуммаКОплате = ВсегоЧасовКОплате * СтоимостьЧасаПоДоговору; 
	КонецЕсли;

	// =====================================================================
	// 3. УВЕДОМЛЕНИЕ В ТЕЛЕГРАМ
	// =====================================================================
	
	ТекстДляБота = "✅ Проведено обслуживание клиента!" + Символы.ПС +
	" Клиент: " + Строка(Клиент) + Символы.ПС +
	" Договор: " + Строка(Договор) + Символы.ПС +
	" Специалист: " + Строка(Специалист) + Символы.ПС +
	"⏳ Всего часов к оплате: " + ВсегоЧасовКОплате;
	
	ЗаписьОчереди = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	ЗаписьОчереди.ТекстСообщения = ТекстДляБота;
	ЗаписьОчереди.Наименование = "Уведомление " + Номер; 
	ЗаписьОчереди.Записать(); 
	
	// =====================================================================
	// 4. ДВИЖЕНИЯ ПО РЕГИСТРУ "ВКМ_ВыполненныеСотрудникомРаботы"
	// =====================================================================
	
	// Получаем процент сотрудника
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ISNULL(Условия.ПроцентОтРабот, -1) КАК Процент
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, Сотрудник = &Специалист) КАК Условия";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Специалист", Специалист);
	
	ВыборкаСотрудника = Запрос.Выполнить().Выбрать();
	
	ПроцентСотрудника = 0;
	
	Если ВыборкаСотрудника.Следующий() Тогда
		ПроцентСотрудника = ВыборкаСотрудника.Процент;
		
		Если ПроцентСотрудника = -1 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не установлен процент оплаты для специалиста (нет записи в регистре)!";
			Сообщение.Сообщить();
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	Иначе

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нет данных об условиях оплаты сотрудника!";
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Запись движений зарплаты
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Для Каждого СтрокаТЧ Из ВыполненныеРаботы Цикл
		
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = СтрокаТЧ.ФактическиПотраченоЧасов;
		Движение.СуммаКОплате = СтрокаТЧ.ФактическиПотраченоЧасов * СтоимостьЧасаПоДоговору * (ПроцентСотрудника / 100);
		
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Если идет загрузка (обмен данными), логику не выполняем
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекстУведомления = "";
	
	// 1. Если документ новый (первая запись)
	Если ЭтоНовый() Тогда
		ТекстУведомления = СтрШаблон(
			"Новая заявка на обслуживание!%1Клиент: %2%1Специалист: %3%1Дата: %4",
			Символы.ПС, 
			Клиент, 
			Специалист, 
			Формат(ДатаПроведенияРабот, "ДЛФ=D"));
			
	Иначе
		// 2. Если документ уже существует, проверяем изменения
		// Получаем "старые" значения из базы данных запросом
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Док.Специалист КАК Специалист,
			|	Док.ДатаПроведенияРабот КАК ДатаРабот,
			|	Док.ВремяНачалаРаботПлан КАК ВремяНачала,
			|	Док.ВремяОкончанияРаботПлан КАК ВремяОкончания
			|ИЗ
			|	Документ.ВКМ_ОбслуживаниеКлиентов КАК Док
			|ГДЕ
			|	Док.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			СписокИзменений = "";
			
			// Сравниваем старое значение (Выборка) с новым (ЭтотОбъект)
			Если Выборка.Специалист <> Специалист Тогда
				СписокИзменений = СписокИзменений + СтрШаблон("%1Специалист: %2 -> %3", Символы.ПС, Выборка.Специалист, Специалист);
			КонецЕсли;
			
			Если Выборка.ДатаРабот <> ДатаПроведенияРабот Тогда
				СписокИзменений = СписокИзменений + СтрШаблон("%1Дата работ: %2 -> %3", Символы.ПС, Формат(Выборка.ДатаРабот, "ДЛФ=D"), Формат(ДатаПроведенияРабот, "ДЛФ=D"));
			КонецЕсли;
			
			Если Выборка.ВремяНачала <> ВремяНачалаРаботПлан Тогда
				СписокИзменений = СписокИзменений + СтрШаблон("%1Начало (план): %2 -> %3", Символы.ПС, Формат(Выборка.ВремяНачала, "ДЛФ=T"), Формат(ВремяНачалаРаботПлан, "ДЛФ=T"));
			КонецЕсли;
			
			Если Выборка.ВремяОкончания <> ВремяОкончанияРаботПлан Тогда
				СписокИзменений = СписокИзменений + СтрШаблон("%1Окончание (план): %2 -> %3", Символы.ПС, Формат(Выборка.ВремяОкончания, "ДЛФ=T"), Формат(ВремяОкончанияРаботПлан, "ДЛФ=T"));
			КонецЕсли;
			
			// Если список изменений не пустой, формируем итоговый текст
			Если ЗначениеЗаполнено(СписокИзменений) Тогда
				ТекстУведомления = "Изменились данные по заявке " + Номер + ":" + СписокИзменений;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Если текст сформирован, сохраняем его в ДополнительныеСвойства, 
	// чтобы передать в процедуру ПриЗаписи
	Если ЗначениеЗаполнено(ТекстУведомления) Тогда
		ДополнительныеСвойства.Вставить("ВКМ_ТекстДляТелеграм", ТекстУведомления);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем, передали ли мы текст из процедуры ПередЗаписью
	Если ДополнительныеСвойства.Свойство("ВКМ_ТекстДляТелеграм") Тогда
		
		ТекстСообщения = ДополнительныеСвойства.ВКМ_ТекстДляТелеграм;
		
		// Создаем элемент справочника уведомлений
		НовоеУведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		
		// Заполняем реквизиты. 
		// Предполагается, что в справочнике есть реквизит ТекстСообщения.
		// Если реквизит называется иначе, поменяйте название здесь.
		НовоеУведомление.ТекстСообщения = ТекстСообщения;
		
		// Можно заполнить наименование для красоты
		НовоеУведомление.Наименование = "Уведомление по документу " + Номер;
		
		// Записываем справочник
		НовоеУведомление.Записать();
		
	КонецЕсли;
	
КонецПроцедуры
